import { News } from "types/type";

export const data_new: News[] = [
  {
    title: "ข่าวเด็ดประจำวันนี้",
    sub_title:
      "เรื่องเด็ด ประเด็นร้อนที่ทุกคนไม่รู้ แต่เรารู้ เพราะเราคือ ogs Daily News เราสืบทุกซอกทุกมุม คติการทำงาน (เรารักงาน ทำงานด้วยความขยันขันแข็ง เที่ยงวันทันเหตุการณ์ไม่ใช่เรา แต่เรามาทันงานแน่นอน)",
    type_new: [
      {
        id: 1,
        name: "ข่าวกีฬา",
        news_type: [
          {
            id: 1,
            headline: "ข่าวกีฬาบอล",
            content:
              "ผลการแข่งขันวันนี้ ลิเวอร์ฟูเอาชนะแมนยู ด้วยคะแนน 5-0 คะแนน",
            date: "2024-04-04",
            time: "08:00",
            category: "ข่าวกีฬา",
            publisher: "ogs Daily News",
          },
          {
            id: 2,
            headline: "ข่าวกีฬาเปตอง",
            content: "เล่นเปตองแบบไทยๆ",
            date: "2024-02-04",
            time: "09:00",
            category: "ข่าวกีฬา",
            publisher: "ogs Daily News",
          },
          {
            id: 3,
            headline: "ข่าวกีฬาตะกร้อ",
            content: "เตะตะกร้อด้วยท่าจระเข้ฟาดหาง",
            date: "2024-03-04",
            time: "09:00",
            category: "ข่าวกีฬา",
            publisher: "ogs Daily News",
          },
          {
            id: 4,
            headline: "ข่าวกีฬาว่ายน้ำ",
            content: "ดานี่ว่ายน้ำเข้าเส้นชัยด้วยท่าผีเสือน้อยในมหาสุมทร",
            date: "2024-01-04",
            time: "09:00",
            category: "ข่าวกีฬา",
            publisher: "ogs Daily News",
          },
        ],
      },
      {
        id: 2,
        name: "ข่าวการเมือง",
        news_type: [
          {
            id: 1,
            headline: "ข่าวการเมืองนารี",
            content: "ท่านนารีเดินหาเสียงด้วย2เท้า",
            date: "2024-01-04",
            time: "10:00",
            category: "ข่าวการเมือง",
            publisher: "News Agency B",
          },
          {
            id: 2,
            headline: "ข่าวการเมืองทรนี",
            content: "ท่านทรนีกินข้าวด้วย2มือ",
            date: "2024-03-04",
            time: "10:00",
            category: "ข่าวการเมือง",
            publisher: "News Agency B",
          },
          {
            id: 3,
            headline: "ข่าวการเมืองมาลี",
            content:
              "ท่านมาลีหัวเราะอย่างมีความสุขเมื่อรู้ว่าตัวเองชนะเลือกตั้ง แต่จริงแล้วท่านนอนฝัน",
            date: "2024-02-04",
            time: "10:00",
            category: "ข่าวการเมือง",
            publisher: "News Agency B",
          },
          {
            id: 4,
            headline: "ข่าวการเมืองตาลี",
            content:
              "ท่านตาลีมองผลคะแนนด้วยตาอย่างเศร้าหมอง เมื่อรู้ว่าตัวเองแพ้แค่100คะแนน",
            date: "2024-04-04",
            time: "10:00",
            category: "ข่าวการเมือง",
            publisher: "News Agency B",
          },
        ],
      },
      {
        id: 3,
        name: "ข่าวดารา",
        news_type: [
          {
            id: 1,
            headline: "ข่าวดาราดาลมเดตร้อน",
            content:
              "ดาลมเดตร้อนกับหมุ่มอาทิตย์จึงทำให้ขอนแก่นร้อนแรงเหมือนซ้อมตลกนรกทั้งวัน แต่มีม้าข้าวมาช่วยให้เราขึ้นสวรรค์ด้วยแอร์ inet",
            date: "2024-04-04",
            time: "11:00",
            category: "ข่าวดารา",
            publisher: "News Agency C",
          },
          {
            id: 2,
            headline: "ข่าวหนูน้อยผู้น่ารักฝากผลงานทางช่องมีสี",
            content:
              "วันนี้ที่คอยรอ..รอคอย หนูน้อยผู้น่ารักตัดสินใจลงเล่นหนัง หลังจากหายหายจากวงการไป 10 ปี",
            date: "2024-02-04",
            time: "11:00",
            category: "ข่าวดารา",
            publisher: "News Agency C",
          },
          {
            id: 3,
            headline: "ข่าวจันทร์เจ้าเอ๋ย ขอข้าวขอแกง",
            content:
              "จันทร์เจ้าผู้นำเทรนด์ เปลี่ยนจากขอแกง เปลี่ยนมาเป็นขอเงิน เพราะทองคำพุ่งสูงในรอบ 500 ปี",
            date: "2024-01-04",
            time: "11:00",
            category: "ข่าวดารา",
            publisher: "News Agency C",
          },
          {
            id: 4,
            headline: "ข่าวแนปซี่ พาตะลุยกินข้าวที่สุดแปลก",
            content:
              "เมื่อวันจันทร์ที่ผ่านมานางเอกสาวอย่างคุณแนปซี่ แนะนำเมนุสุดโหด สุดแปลกให้เรา แต่ไม่รู้คือเมนูอะไรเพราะแบตกล้องหมดก่อน",
            date: "2024-03-04",
            time: "11:00",
            category: "ข่าวดารา",
            publisher: "News Agency C",
          },
        ],
      },
      {
        id: 4,
        name: "ข่าวทั่วไป",
        news_type: [
          {
            id: 1,
            headline: "ข่าวสุดแปลกไก่ออกลูกเป็นไข่",
            content: "เมื่อวานที่ผ่านมาล่าสุดมีคนพบเห็นไก่ออกลูกเป็นไข่",
            date: "2024-01-04",
            time: "12:00",
            category: "ข่าวทั่วไป",
            publisher: "News Agency D",
          },
          {
            id: 2,
            headline: "ข่าวเรื่องที่ทุกคนไม่รู้ ตอนนี้เราสามรถดื่มน้ำได้แล้วนะ",
            content:
              "พนักงานบริษัทแห่งหนึ่งลืมการดื่มน้ำ หลังจากกินน้ำหวานมาทั้งวัน",
            date: "2024-03-04",
            time: "12:00",
            category: "ข่าวทั่วไป",
            publisher: "News Agency D",
          },
          {
            id: 3,
            headline: "ข่าวดื่มน้ำแบบไหนดี?",
            content: "รู้หรือไม่! ตอนนี้เราสามารถดื่มได้วันละ8แก้ว",
            date: "2024-04-04",
            time: "12:00",
            category: "ข่าวทั่วไป",
            publisher: "News Agency D",
          },
          {
            id: 4,
            headline: "ข่าวเราจะนั่งทำงานแบบไหนดี วันนี้เรามีคำตอบ",
            content: "นั่งแบบที่เราสบาย นั่งแบบไหนก็ได้",
            date: "2024-02-04",
            time: "12:00",
            category: "ข่าวทั่วไป",
            publisher: "News Agency D",
          },
        ],
      },
    ],
  },
];
